zgzwangxin/nrf51/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/experimental_ble_app_buttonless_dfu_uart _16K_RAM_51822XXAA/main.c
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);

    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}

/**@brief  Function for initializing the UART module.
 */


/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\r\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */

/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);

    APP_ERROR_CHECK(err_code);
}


//APP_TIMER_DEF(m_test_timer_id);                  /**< open cmd timer. */

//static void test_timer_handler(void * p_context)
//{
//    UNUSED_PARAMETER(p_context);
//    
////    nrf_gpio_pin_write(20, !nrf_gpio_pin_out_read(20));
////    nrf_gpio_pin_write(0, !nrf_gpio_pin_out_read(0));
//    
//    nrf_gpio_pin_toggle(0);
//    nrf_gpio_pin_toggle(20);

//	// 
//}

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
	uart_init();
    timers_init();
	
	// 关闭LED2、3、4
	nrf_gpio_cfg_output(20);
	nrf_gpio_pin_write(20, LEDS_ACTIVE_STATE ? 0 : 1);
//	nrf_gpio_cfg_output(21);
//	nrf_gpio_pin_write(21, LEDS_ACTIVE_STATE ? 0 : 1);
//	nrf_gpio_cfg_output(22);
//	nrf_gpio_pin_write(22, LEDS_ACTIVE_STATE ? 0 : 1);
//    
//    nrf_gpio_cfg_output(30);
//	nrf_gpio_pin_write(30, LEDS_ACTIVE_STATE ? 0 : 1);
//    nrf_gpio_cfg_output(0);
//	nrf_gpio_pin_write(0, LEDS_ACTIVE_STATE ? 0 : 1);
	
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        NRF_LOG_DEBUG("Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    NRF_LOG_DEBUG("Services are initialized\r\n");
    conn_params_init();
    NRF_LOG_DEBUG("conn params are initialized\r\n");
    // Start execution.
    application_timers_start();
    NRF_LOG_DEBUG("app timers are started\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_DEBUG("advertising is started\r\n");
    
//    nrf_gpio_cfg_output(20);
//	nrf_gpio_pin_write(20, LEDS_ACTIVE_STATE ? 1 : 0);
//   sleep_mode_enter();
    
//    err_code = app_timer_create(&m_test_timer_id,
//							APP_TIMER_MODE_REPEATED,
//							test_timer_handler);
//	APP_ERROR_CHECK(err_code);
//    
//    err_code = app_timer_start(m_test_timer_id, APP_TIMER_TICKS(1000, APP_TIMER_PRESCALER), NULL);
//	APP_ERROR_CHECK(err_code);

//    nrf_gpio_cfg_input(16, NRF_GPIO_PIN_PULLDOWN);
//    nrf_gpio_cfg_input(17, NRF_GPIO_PIN_PULLUP);
//    nrf_gpio_cfg_input(18, NRF_GPIO_PIN_NOPULL);

//    ble_bas_battery_level_update(&m_bas, 50);
    
    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
//            nrf_gpio_pin_write(0, LEDS_ACTIVE_STATE ? 0 : 1);
//            nrf_gpio_pin_write(22, LEDS_ACTIVE_STATE ? 0 : 1);
            power_manage();
//            nrf_gpio_pin_write(0, LEDS_ACTIVE_STATE ? 1 : 0);
//            nrf_gpio_pin_write(22, LEDS_ACTIVE_STATE ? 1 : 0);
        }
    }
}


/**
 * @}
 */
